Revit 2027 API
ViewSheet.CanBeDuplicated Method
 Identifies if this sheet can be duplicated.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanBeDuplicated(
	SheetDuplicateOption duplicateOption
)
Public Function CanBeDuplicated (
	duplicateOption As SheetDuplicateOption
) As Boolean
public:
bool CanBeDuplicated(
	SheetDuplicateOption duplicateOption
)
member CanBeDuplicated :
        duplicateOption : SheetDuplicateOption -> bool
Parameters
duplicateOption SheetDuplicateOption
 The option to use when duplicating the sheet.
Return Value
Boolean
 True if the sheet can be duplicated, false otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
ViewSheet Class
Autodesk.Revit.DB Namespace